{
  "_class_name": "VQModel",
  "_diffusers_version": "0.21.4",
  "_name_or_path": "femboysLover/vqmodel_tf2_spy",
  "act_fn": "silu",
  "block_out_channels": [
    32,
    64,
    128,
    256
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "force_upcast": false,
  "in_channels": 3,
  "latent_channels": 1,
  "layers_per_block": 4,
  "lookup_from_codebook": false,
  "mid_block_add_attention": true,
  "norm_num_groups": 32,
  "norm_type": "group",
  "num_vq_embeddings": 2048,
  "out_channels": 3,
  "sample_size": 256,
  "scaling_factor": 0.5,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ],
  "vq_embed_dim": null
}
